{
    "common": {
        "name": "vis-materialdesign",
        "version": "0.1.5",
        "news": {
            "0.1.5": {
                "en": "bar and pie chart added",
                "de": "Balken- und Kreisdiagramm hinzugefügt",
                "ru": "добавлена гистограмма и круговая диаграмма",
                "pt": "barra e gráfico de pizza adicionados",
                "nl": "bar en cirkeldiagram toegevoegd",
                "fr": "diagramme à barres et à secteurs ajouté",
                "it": "barra e grafico a torta aggiunti",
                "es": "barra y gráfico agregado",
                "pl": "dodano wykres słupkowy i kołowy",
                "zh-cn": "添加了条形图和饼图"
            },
            "0.1.2": {
                "en": "support for non boolean values added for buttons, checkboxes and switches. haptic feedback (vibration) option for mobil browser added. right label option for list added. slider value text option for lees or greather than added. bug fixes.",
                "de": "Unterstützung für nicht-boolesche Werte für Schaltflächen, Kontrollkästchen und Schalter. Option für haptisches Feedback (Vibration) für mobilen Browser hinzugefügt. Rechte Beschriftungsoption für Liste hinzugefügt. Textoption mit Schieberegler für kleiner oder größer als hinzugefügt. Fehlerbehebung.",
                "ru": "добавлена поддержка не булевых значений для кнопок, флажков и переключателей. Добавлена опция тактильной обратной связи (вибрация) для мобильного браузера. добавлена правая метка для списка. текстовая опция значения ползунка для ли или больше, чем добавлено. исправление ошибок.",
                "pt": "suporte para valores não booleanos adicionados a botões, caixas de seleção e opções. opção de retorno háptico (vibração) para o navegador mobil adicionado. opção de etiqueta à direita para a lista adicionada. opção de texto do valor do controle deslizante para borras ou maior que a adicionada. correções de bugs.",
                "nl": "ondersteuning voor niet-booleaanse waarden toegevoegd voor knoppen, selectievakjes en schakelaars. haptische feedback (vibratie) optie voor mobil browser toegevoegd. juiste labeloptie voor lijst toegevoegd. schuif waarde optie voor lees of groter dan toegevoegd. bugfixes.",
                "fr": "prise en charge des valeurs non booléennes ajoutées pour les boutons, les cases à cocher et les commutateurs. retour haptique option (vibration) pour le navigateur mobil ajouté. option bonne étiquette pour la liste ajoutée. option de texte de valeur de curseur pour les lies ou plus grand que ajouté. corrections de bugs.",
                "it": "supporto per valori non booleani aggiunto per pulsanti, caselle di controllo e interruttori. aggiunta dell'opzione feedback tattile (vibrazione) per il browser mobil. opzione etichetta destra per elenco aggiunto. opzione di testo del valore del dispositivo di scorrimento per le fecce o maggiore di quella aggiunta. correzioni di bug.",
                "es": "soporte para valores no booleanos agregados para botones, casillas de verificación e interruptores. Opción de retroalimentación háptica (vibración) para el navegador mobil agregado. opción de etiqueta derecha para la lista agregada. opción de texto del valor del control deslizante para lías o más grande que el agregado. corrección de errores.",
                "pl": "dodano obsługę wartości innych niż logiczne dla przycisków, pól wyboru i przełączników. dodano opcję dotykowego sprzężenia zwrotnego (wibracji) dla przeglądarki mobilnej. dodano opcję prawej etykiety dla listy. suwakowa wartość opcji tekstowej dla osadów lub większa niż dodana. poprawki błędów.",
                "zh-cn": "支持为按钮，复选框和开关添加的非布尔值。为Mobil浏览器添加了触觉反馈（振动）选项。列表的右侧标签选项已添加。滑块值文本选项，用于添加或添加的内容。 bug修复。"
            },
            "0.1.1": {
                "en": "bug fixes",
                "de": "Fehlerbehebung",
                "ru": "исправление ошибок",
                "pt": "correções de bugs",
                "nl": "bugfixes",
                "fr": "corrections de bugs",
                "it": "correzioni di bug",
                "es": "corrección de errores",
                "pl": "poprawki błędów",
                "zh-cn": "bug修复"
            },
            "0.1.0": {
                "en": "first official release for latest repository",
                "de": "erste offizielle Veröffentlichung für das latest Repository",
                "ru": "первый официальный релиз для последнего репозитория",
                "pt": "primeiro lançamento oficial do repositório mais recente",
                "nl": "eerste officiële release voor de nieuwste repository",
                "fr": "première version officielle pour le dernier référentiel",
                "it": "prima versione ufficiale per l'ultimo repository",
                "es": "primer lanzamiento oficial para el último repositorio",
                "pl": "pierwsze oficjalne wydanie najnowszego repozytorium",
                "zh-cn": "最新版本库的第一个正式版本"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "Material Design Widgets",
        "titleLang": {
            "en": "Material Design Widgets",
            "de": "Material Design Widgets",
            "ru": "Material Design Widgets",
            "pt": "Material Design Widgets",
            "nl": "Material Design Widgets",
            "fr": "Material Design Widgets",
            "it": "Material Design Widgets",
            "es": "Material Design Widgets",
            "pl": "Material Design Widgets",
            "zh-cn": "Material Design Widgets"
        },
        "desc": {
            "en": "Material Design Widgets based on Google material components web library",
            "de": "Material Design Widgets basiert auf der Material Components Bibliothek von Google",
            "ru": "Виджеты дизайна материалов на основе веб-библиотеки компонентов материалов Google",
            "pt": "Widgets de design de materiais baseados na biblioteca da Web de componentes de materiais do Google",
            "nl": "Widgets voor materiaalontwerp op basis van de webbibliotheek voor materiaalcomponenten van Google",
            "fr": "Matériels de conception de matériaux basés sur la bibliothèque Web de Google sur les composants matériels",
            "it": "Widget di progettazione dei materiali basati sulla libreria web dei componenti materiali di Google",
            "es": "Widgets de diseño de materiales basados en la biblioteca web de componentes de material de Google",
            "pl": "Widżety projektowania materiałów na podstawie biblioteki internetowej komponentów materiałów Google",
            "zh-cn": "Material Design Widgets基于Google材料组件Web库"
        },
        "authors": [
            "Scrounger <scrounger@gmx.net>"
        ],
        "keywords": [
            "vis",
            "material",
            "GUI"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "vis-materialdesign.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/Scrounger/ioBroker.vis-materialdesign/master/admin/vis-materialdesign.png",
        "readme": "https://github.com/Scrounger/ioBroker.vis-materialdesign/blob/master/README.md",
        "loglevel": "info",
        "restartAdapters": [
            "vis"
        ],
        "localLink": "%web_protocol%://%ip%:%web_port%/vis/edit.html",
        "onlyWWW": true,
        "noConfig": true,
        "singleton": true,
        "type": "visualization-widgets",
        "mode": "once",
        "dependencies": [
            "vis"
        ]
    },
    "native": {
        "dependencies": [
            "basic"
        ]
    },
    "objects": [],
    "instanceObjects": []
}