{
    "common": {
        "name": "vis-materialdesign",
        "version": "0.2.78",
        "news": {
            "0.2.76": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            }, 
            "0.2.66": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },             
            "0.2.59": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },            
            "0.2.49": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },
            "0.2.32": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },
            "0.2.30": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },            
            "0.2.22": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },
            "0.2.9": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },
            "0.2.7": {
                "en": "see changelog",
                "de": "siehe Changelog",
                "ru": "см. список изменений",
                "pt": "veja changelog",
                "nl": "zie changelog",
                "fr": "voir changelog",
                "it": "vedi il log delle modifiche",
                "es": "ver registro de cambios",
                "pl": "patrz dziennik zmian",
                "zh-cn": "看到变更日志"
            },
            "0.2.4": {
                "en": "Round Slider Widget bug fixes. Line History Chart Widget null value bug fixes, tooltip  and translation improved",
                "de": "Round Slider Widget Fehlerbehebung. Line History Chart Widget Fehlerbehebung (null Werte, Tooltip) und Übersetzung verbessert",
                "ru": "Исправлены ошибки в виджете Round Slider. Исправлена ошибка с нулевым значением в виджете истории линий, улучшена подсказка и перевод",
                "pt": "Correções de erros do Round Slider Widget. Widget do Gráfico de Histórico de Linhas Correção de erros de valor nulo, dica de ferramenta e tradução aprimoradas",
                "nl": "Bugfixes voor Round Slider Widget. Line History Chart Widget null-waarde bugfixes, tooltip en vertaling verbeterd",
                "fr": "Arrondi de corrections de bugs Widget Widget. Amélioration des corrections de bugs, des info-bulles et de la traduction des valeurs null pour l'historique des graphiques en ligne",
                "it": "Correzioni di bug di Round Slider Widget. Widget del grafico della cronologia delle linee migliorate correzioni di bug valore zero, descrizione comandi e traduzione",
                "es": "Corrección de errores del widget Slider redondo. Gráfico de historial de línea Widget valor nulo correcciones de errores, información sobre herramientas y traducción mejorada",
                "pl": "Poprawki błędów w Round Slider Widget. Poprawki błędów wartości wykresu historii linii, poprawione podpowiedzi i tłumaczenie",
                "zh-cn": "Round Slider Widget错误修复。线历史记录图表小部件的空值错误修复，工具提示和翻译得到改进"
            },
            "0.2.0": {
                "en": "Round-Slider, Icon Button Adition, Button Adition, Line History Chart, Table, Dialog iFrame, Dialog View and Select Widgets added",
                "de": "Round-Slider, Icon Button Adition, Button Adition, Line History Chart, Table, Dialog iFrame, Dialog View and Select Widgets hinzugefügt",
                "ru": "Добавлены круговой ползунок, значок кнопки добавления, кнопка добавления, диаграмма истории линий, таблица, диалоговое окно iFrame, диалоговое окно и выбор виджетов",
                "pt": "Controle deslizante redondo, adição de botão de ícone, adição de botão, gráfico de histórico de linhas, tabela, iFrame de diálogo, visualização de caixa de diálogo e widgets selecionados adicionados",
                "nl": "Round-Slider, Icon Button Adition, Button Adition, Line History Chart, Table, Dialog iFrame, Dialog View en Select Widgets toegevoegd",
                "fr": "Curseur rond, ajout de boutons d'icône, ajouts de boutons, graphique d'historique des lignes, tableau, iFrame de dialogue, affichage de dialogue et sélection de widgets ajoutés",
                "it": "Cursore circolare, Icona pulsante aggiunta, Pulsante aggiunta, Grafico cronologico linee, Tabella, Finestra di dialogo iFrame, Finestra di dialogo Visualizza e Seleziona widget aggiunti",
                "es": "Control deslizante redondo, adición de botón de icono, adición de botón, gráfico de historial de línea, tabla, iFrame de diálogo, vista de diálogo y selección de widgets agregados",
                "pl": "Dodano okrągły przycisk, ikonę przycisku, przycisk przycisku, wykres historii linii, tabelę, okno dialogowe iFrame, widok okna dialogowego i wybrane widżety",
                "zh-cn": "添加了滑条，图标按钮添加，按钮添加，折线图，表格，对话框iFrame，对话框视图和选择小部件"
            },
            "0.1.5": {
                "en": "bar and pie chart added",
                "de": "Balken- und Kreisdiagramm hinzugefügt",
                "ru": "добавлена гистограмма и круговая диаграмма",
                "pt": "barra e gráfico de pizza adicionados",
                "nl": "bar en cirkeldiagram toegevoegd",
                "fr": "diagramme à barres et à secteurs ajouté",
                "it": "barra e grafico a torta aggiunti",
                "es": "barra y gráfico agregado",
                "pl": "dodano wykres słupkowy i kołowy",
                "zh-cn": "添加了条形图和饼图"
            },
            "0.1.2": {
                "en": "support for non boolean values added for buttons, checkboxes and switches. haptic feedback (vibration) option for mobil browser added. right label option for list added. slider value text option for lees or greather than added. bug fixes.",
                "de": "Unterstützung für nicht-boolesche Werte für Schaltflächen, Kontrollkästchen und Schalter. Option für haptisches Feedback (Vibration) für mobilen Browser hinzugefügt. Rechte Beschriftungsoption für Liste hinzugefügt. Textoption mit Schieberegler für kleiner oder größer als hinzugefügt. Fehlerbehebung.",
                "ru": "добавлена поддержка не булевых значений для кнопок, флажков и переключателей. Добавлена опция тактильной обратной связи (вибрация) для мобильного браузера. добавлена правая метка для списка. текстовая опция значения ползунка для ли или больше, чем добавлено. исправление ошибок.",
                "pt": "suporte para valores não booleanos adicionados a botões, caixas de seleção e opções. opção de retorno háptico (vibração) para o navegador mobil adicionado. opção de etiqueta à direita para a lista adicionada. opção de texto do valor do controle deslizante para borras ou maior que a adicionada. correções de bugs.",
                "nl": "ondersteuning voor niet-booleaanse waarden toegevoegd voor knoppen, selectievakjes en schakelaars. haptische feedback (vibratie) optie voor mobil browser toegevoegd. juiste labeloptie voor lijst toegevoegd. schuif waarde optie voor lees of groter dan toegevoegd. bugfixes.",
                "fr": "prise en charge des valeurs non booléennes ajoutées pour les boutons, les cases à cocher et les commutateurs. retour haptique option (vibration) pour le navigateur mobil ajouté. option bonne étiquette pour la liste ajoutée. option de texte de valeur de curseur pour les lies ou plus grand que ajouté. corrections de bugs.",
                "it": "supporto per valori non booleani aggiunto per pulsanti, caselle di controllo e interruttori. aggiunta dell'opzione feedback tattile (vibrazione) per il browser mobil. opzione etichetta destra per elenco aggiunto. opzione di testo del valore del dispositivo di scorrimento per le fecce o maggiore di quella aggiunta. correzioni di bug.",
                "es": "soporte para valores no booleanos agregados para botones, casillas de verificación e interruptores. Opción de retroalimentación háptica (vibración) para el navegador mobil agregado. opción de etiqueta derecha para la lista agregada. opción de texto del valor del control deslizante para lías o más grande que el agregado. corrección de errores.",
                "pl": "dodano obsługę wartości innych niż logiczne dla przycisków, pól wyboru i przełączników. dodano opcję dotykowego sprzężenia zwrotnego (wibracji) dla przeglądarki mobilnej. dodano opcję prawej etykiety dla listy. suwakowa wartość opcji tekstowej dla osadów lub większa niż dodana. poprawki błędów.",
                "zh-cn": "支持为按钮，复选框和开关添加的非布尔值。为Mobil浏览器添加了触觉反馈（振动）选项。列表的右侧标签选项已添加。滑块值文本选项，用于添加或添加的内容。 bug修复。"
            },
            "0.1.1": {
                "en": "bug fixes",
                "de": "Fehlerbehebung",
                "ru": "исправление ошибок",
                "pt": "correções de bugs",
                "nl": "bugfixes",
                "fr": "corrections de bugs",
                "it": "correzioni di bug",
                "es": "corrección de errores",
                "pl": "poprawki błędów",
                "zh-cn": "bug修复"
            },
            "0.1.0": {
                "en": "first official release for latest repository",
                "de": "erste offizielle Veröffentlichung für das latest Repository",
                "ru": "первый официальный релиз для последнего репозитория",
                "pt": "primeiro lançamento oficial do repositório mais recente",
                "nl": "eerste officiële release voor de nieuwste repository",
                "fr": "première version officielle pour le dernier référentiel",
                "it": "prima versione ufficiale per l'ultimo repository",
                "es": "primer lanzamiento oficial para el último repositorio",
                "pl": "pierwsze oficjalne wydanie najnowszego repozytorium",
                "zh-cn": "最新版本库的第一个正式版本"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "Material Design Widgets",
        "titleLang": {
            "en": "Material Design Widgets",
            "de": "Material Design Widgets",
            "ru": "Material Design Widgets",
            "pt": "Material Design Widgets",
            "nl": "Material Design Widgets",
            "fr": "Material Design Widgets",
            "it": "Material Design Widgets",
            "es": "Material Design Widgets",
            "pl": "Material Design Widgets",
            "zh-cn": "Material Design Widgets"
        },
        "desc": {
            "en": "Material Design Widgets are based on Google's material design guidelines. The adapter uses different libraries (material components web library, vuetify, chartjs, etc.).",
            "de": "Material Design Widgets basieren auf den Google-Richtlinien für das Material Design. Dabei verwendet der Adapter verschiedene Bibliothek (material components web library, vuetify, chartjs, etc.).",
            "ru": "Виджеты для проектирования материалов основаны на руководстве Google по проектированию материалов. Адаптер использует различные библиотеки (material components web library, vuetify, chartjs, и т.д.).",
            "pt": "Os Widgets de design de materiais são baseados nas diretrizes de design de materiais do Google. O adaptador usa bibliotecas diferentes (material components web library, vuetify, chartjs, etc.).",
            "nl": "Material Design Widgets zijn gebaseerd op de materiaalontwerprichtlijnen van Google. De adapter maakt gebruik van verschillende bibliotheken (material components web library, vuetify, chartjs, etc.).",
            "fr": "Les Widgets de conception de matériaux sont basés sur les directives de conception de matériaux de Google. L'adaptateur utilise différentes bibliothèques (material components web library, vuetify, chartjs, etc.).",
            "it": "I widget per il design dei materiali si basano sulle linee guida per il design dei materiali di Google. L'adattatore utilizza diverse librerie (material components web library, vuetify, chartjs, ecc.)",
            "es": "Los Widgets de diseño de materiales se basan en las directrices de diseño de materiales de Google. El adaptador utiliza diferentes librerías (material components web library, vuetify, chartjs, etc.).",
            "pl": "Widgety do projektowania materiałów oparte są na wytycznych Google dotyczących projektowania materiałów. Adapter wykorzystuje różne biblioteki (material components web library, vuetify, chartjs, itp.)",
            "zh-cn": "Material Design Widgets基于Google的Material Design准则。适配器使用不同的库（材料组件Web库，vuetify，chartjs等）。"
        },
        "authors": [
            "Scrounger <scrounger@gmx.net>"
        ],
        "keywords": [
            "vis",
            "material",
            "GUI"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "vis-materialdesign.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/Scrounger/ioBroker.vis-materialdesign/master/admin/vis-materialdesign.png",
        "readme": "https://github.com/Scrounger/ioBroker.vis-materialdesign/blob/master/README.md",
        "loglevel": "info",
        "restartAdapters": [
            "vis",
            "web"
        ],
        "localLink": "%web_protocol%://%ip%:%web_port%/vis/edit.html",
        "onlyWWW": true,
        "noConfig": true,
        "singleton": true,
        "type": "visualization-widgets",
        "mode": "once",
        "dependencies": [
            "vis"
        ]
    },
    "native": {
        "dependencies": [
            "basic"
        ]
    },
    "objects": [],
    "instanceObjects": []
}